[
  {
    "id": "feat:mage-hand-legerdemain",
    "class": "Arcane Trickster",
    "name": "Mage Hand Legerdemain",
    "level": 3,
    "description": "When you cast Mage Hand, you can make the spectral hand invisible, and you can perform additional tasks with it:\n\n- You can stow one object the hand is holding in a container worn or carried by another creature.\nYou can retrieve an object in a container worn or carried by another creature.\nYou can use thieves' tools to pick locks and disarm traps at range.\n\nYou can perform one of these tasks without being noticed by a creature if you succeed on a Dexterity (Sleight of Hand) check contested by the creature's Wisdom (Perception) check.\n\nIn addition, you can use the bonus action granted by your Cunning Action to control the hand.",
    "mechanics": [
      {
        "type": "bonus_action",
        "activation": {
          "type": "bonus_action",
          "trigger": {
            "event": ["cast_spell"]
          }
        },
        "name": "move_illusion",
        "effects": [
          {
            "movement": {
              "target": {
                "type": "entity",
                "value": ["spectral_hand"]
              },
              "distance": 30,
              "visibility": {
                "requires": "line_of_sight"
              }
            }
          }
        ]
      }
    ],
    "source": "phb",
    "ruleset": "dnd5e"
  },
  {
    "id": "feat:magical-ambush",
    "class": "Arcane Trickster",
    "name": "Magical Ambush",
    "level": 9,
    "description": "If you are hidden from a creature when you cast a spell on it, the creature has disadvantage on any saving throw it makes against the spell this turn.",
    "mechanics": [
      {
        "type": "passive",
        "trigger": {
          "event": ["cast_spell"]
        },
        "requirements": [
          {
            "type": "perception",
            "observer": "target",
            "subject": "character",
            "senses": ["sight"],
            "negate": true
          }
        ],
        "effects": [
          {
            "disadvantage": {
              "saving_throw": ["Strength", "Dexterity", "Constitution", "Intelligence", "Wisdom", "Charisma"],
              "target": {
                "type": "event_recipient"
              }
            }
          }
        ]
      }
    ],
    "source": "phb",
    "ruleset": "dnd5e"
  },
  {
    "id": "feat:versatile-trickster",
    "class": "Arcane Trickster",
    "name": "Versatile Trickster",
    "level": 13,
    "description": "You gain the ability to distract targets with your Mage Hand. As a bonus action on your turn, you can designate a creature within 5 feet of the spectral hand created by the spell. Doing so gives you advantage on attack rolls against that creature until the end of the turn.",
    "mechanics": [
      {
        "type": "bonus_action",
        "target": {
          "type": "creature",
          "count": 1,
          "disposition": "hostile"
        },
        "effects": [
          {
            "advantage": {
              "attack": "all",
              "requirements": [
                {
                  "type": "proximity",
                  "entities": ["mage_hand"],
                  "distance": 5,
                  "to": "target"
                }
              ]
            }
          }
        ]
      }
    ],
    "source": "phb",
    "ruleset": "dnd5e"
  },
  {
    "id": "feat:spell-thief",
    "class": "Arcane Trickster",
    "name": "Spell Thief",
    "level": 17,
    "description": "You gain the ability to magically steal the knowledge of how to cast a spell from another spellcaster.\n\nImmediately after a creature casts a spell that targets you or includes you in its area of effect, you can use your reaction to force the creature to make a saving throw with its spellcasting ability modifier. The DC equals your spell save DC. On a failed save, you negate the spell's effect against you, and you steal the knowledge of the spell if it is at least 1st level and of a level you can cast (it doesn't need to be a wizard spell). For the next 8 hours, you know the spell and can cast it using your spell slots. The creature can't cast that spell until the 8 hours have passed.\n\nOnce you use this feature, you can't use it again until you finish a long rest.",
    "mechanics": [],
    "source": "phb",
    "ruleset": "dnd5e"
  }
]
